
const common = {
	data() {
		return {
			weekTxt: {
				1: '第一周',
				2: '第二周',
				3: '第三周',
				4: '第四周',
				5: '第五周',
				6: '第六周',
				7: '第七周',
				8: '第八周',
				9: '第九周',
				10: '第十周',
				11: '第十一周',
				12: '第十二周',
				13: '第十三周',
				14: '第十四周',
				15: '第十五周',
				16: '第十六周',
				17: '第十七周',
				18: '第十八周',
				19: '第十九周',
				20: '第二十周',
				21: '第二十一周',
				22: '第二十二周',
				23: '第二十三周',
				24: '第二十四周',
				25: '第二十五周'
			},
			dayTxt: {
				1: '星期一',
				2: '星期二',
				3: '星期三',
				4: '星期四',
				5: '星期五'
			},
			sectionTxt: {
				1: '第一、二节',
				2: '第三、四节',
				3: '第五、六节',
				4: '第七、八节'
			}
		}
	},
	methods: {
		/* 
		* 消息提示
		* 
		*/
		showMsg(type, msg, time = 2000, showClose = true) {
			this.$message({
				type: type,
				message: msg,
				showClose: showClose,
				duration: time
			})
		}
	}
}

export { common } 